Dlubal.RFEM5.ILineSupport2
Interface for working with line support

Dlubal.RFEM5.ILineSupport2.GetData
Gets line support parameters.
Returns: Line support parameters.

Dlubal.RFEM5.ILineSupport2.SetData(System.UInt32@)
Sets line support parameters.
Support: Line support parameters.

Dlubal.RFEM5.ILineSupport2.Delete
Deletes line support.

Dlubal.RFEM5.ILineSupport2.GetNonlinearity(System.UInt32)
Gets interface for working with nodal support nonlinearity.
Returns: Nonlinearity interface.
Direction: Nonlinearity direction.